/*FileName: a20f5
*  ------------------
* Να γραφεί ένα πρόγραμμα το οποίο να διαβάζει 5 ακεραίους και να τους αποθηκεύει σε έναν πίνακα. Στη
συνέχεια, το πρόγραμμα να περιστρέφει τα στοιχεία του πίνακα μία θέση δεξιά και θα τυπώνει τον πίνακα
στην οθόνη. Για παράδειγμα, αν τα στοιχεία του πίνακα είναι: 1, -9, 5, 3, 4 ο πίνακας μετά την περιστροφή
θα είναι: 4, 1, -9, 5, 3.
*/

#include <stdio.h>
#include "simpio.h"
#include "genlib.h"

//Επεξεργασία
int main() {
   int i; //ορισμός τύπου μεταβλητής
   int table[5]; //ορισμός του πίνακα  5 θέσεων

   for (i=0; i<=4; i++){ // συμπληρώνω τον πίνακα με ακεραίους
      printf("Enter number: ");
      table[i] = GetInteger();
   }

   int last=table[4];  //θέτω στη μεταβλητή last το τελευταίο στοιχείο
                      //για να το χρησιμοποιήσω μετά
   for(i=4; i>=0;i--){  //μεταθέτω τα στοιχεία μια θέση δεξιά
       int k=table[i-1]; //ξεκινώντας απ την τελευταία θέση
       table[i]=k;

         }

   table[0]=last;  //το τελευταίο στοιχείο του πίνακα πάει στην πρώτη θέση

   //Εμφάνιση Δεδομένων
   for(i=0; i<5; i++)
      printf("%d ",table[i]);

   return 0;
 }
